#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Reading...
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Read complete after 0s [id=ee097a689c316305dc21eca93a9a9d3e10d72781]
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:836049003243:certificate/d7d1744d-ab77-4465-b2ba-34ed7e5261bf]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Reading...
module.cdn.aws_cloudfront_function.remove_path: Refreshing state... [id=remove-path]
data.aws_route53_zone.domain_zone: Reading...
module.s3_bucket.aws_s3_bucket.website: Refreshing state... [id=mulla-website]
module.cdn.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3VYA4SSHYAMAS]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.cloudfront_waf.aws_wafv2_web_acl.web_acl: Refreshing state... [id=188831b4-b4e6-4801-ae52-1bbc3a57fe64]
module.s3_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=mulla-website]
module.s3_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=mulla-website]
module.s3_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls: Refreshing state... [id=mulla-website]
module.s3_bucket.aws_s3_bucket_cors_configuration.cors: Refreshing state... [id=mulla-website]
module.lambda_layers.aws_s3_object.lambda_code_zip["utility_zip_file"]: Refreshing state... [id=lambda_zip/layer/utility_zip_file]
data.aws_route53_zone.domain_zone: Read complete after 0s [id=Z019756110G25DTYU8A62]
module.lambda_layers.module.lambda_layer["utility_zip_file"].aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:836049003243:layer:mulla-website-utility:10]
module.acm_certificate.aws_route53_record.app["api.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__a54e3b575b8c64afeaa561b04feeb168.api.mulla.au._CNAME]
module.dns.aws_route53_record.www: Refreshing state... [id=Z019756110G25DTYU8A62_www_CNAME]
module.acm_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.s3_bucket.aws_s3_bucket_acl.website_acl: Refreshing state... [id=mulla-website,private]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-06-18 06:40:08.843 +0000 UTC]
module.api.module.email.data.archive_file.lambda_source_package: Reading...
module.api.module.email.data.archive_file.lambda_source_package: Read complete after 0s [id=1b1caa051b3902d661681635fc83abcad5ca5b4e]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=soliqodt1c]
module.api.module.email.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/email]
module.api.aws_iam_role.api_role: Refreshing state... [id=mulla-website-api-role]
module.api.aws_iam_role.cloudwatch: Refreshing state... [id=mulla-website-api-cloudwatch-role]
module.api.module.email.module.email_lambda.data.aws_caller_identity.current: Reading...
module.api.module.email.module.email_lambda.data.aws_region.current: Reading...
module.api.module.email.module.email_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-email]
module.api.module.email.module.email_lambda.data.aws_partition.current: Reading...
module.api.module.email.module.email_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.email.module.email_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.email.module.email_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.email.module.email_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.email.module.email_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.email.module.email_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-email]
module.api.module.email.module.email_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.email.module.email_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2576865068]
module.api.module.email.module.email_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-email-inline]
module.api.aws_cloudwatch_log_group.api_gateway_execution_logs: Refreshing state... [id=API-Gateway-Execution-Logs_soliqodt1c/production]
module.api.aws_api_gateway_resource.email: Refreshing state... [id=69tu7t]
module.api.module.email.module.email_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.email.module.email_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2953527047]
module.api.module.email.module.email_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-email-logs]
module.api.aws_iam_role_policy.cloudwatch: Refreshing state... [id=mulla-website-api-cloudwatch-role:mulla-website-cloudwatch-policy]
module.api.aws_api_gateway_account.api_cloudwatch_role: Refreshing state... [id=api-gateway-account]
module.api.module.email.module.email_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-email-20230620103255704900000001]
module.api.module.email.aws_api_gateway_method.email: Refreshing state... [id=agm-soliqodt1c-69tu7t-POST]
module.api.module.email.module.email_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-email-20230620094047156200000001]
module.api.module.email.module.email_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-email]
module.api.module.email.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.module.email.aws_api_gateway_integration.email_lambda_integration: Refreshing state... [id=agi-soliqodt1c-69tu7t-POST]
module.api.aws_api_gateway_deployment.api_deploy: Refreshing state... [id=5dxncz]
module.api.aws_api_gateway_stage.apigw_stage: Refreshing state... [id=ags-soliqodt1c-production]
module.api.aws_api_gateway_method_settings.apigw_setting: Refreshing state... [id=soliqodt1c-production-*/*]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E7UYT0229HQ8N]
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z019756110G25DTYU8A62_mulla.au_A]
module.website.aws_s3_bucket_server_side_encryption_configuration.s3_encryption: Refreshing state... [id=mulla-website]
module.website.data.aws_iam_policy_document.website_policy: Reading...
module.website.data.aws_caller_identity.current: Reading...
module.website.data.aws_iam_policy_document.website_policy: Read complete after 0s [id=2209799388]
module.website.aws_s3_bucket_policy.access: Refreshing state... [id=mulla-website]
module.website.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.website.aws_s3_object.images["tarek-mulla.jpg"]: Refreshing state... [id=images/tarek-mulla.jpg]
module.website.aws_s3_object.images["ehealth.png"]: Refreshing state... [id=images/ehealth.png]
module.website.aws_s3_object.images["iress.png"]: Refreshing state... [id=images/iress.png]
module.website.aws_s3_object.images["rmit.jpg"]: Refreshing state... [id=images/rmit.jpg]
module.website.aws_s3_object.images["portfolio.png"]: Refreshing state... [id=images/portfolio.png]
module.website.aws_s3_object.images["tbb.png"]: Refreshing state... [id=images/tbb.png]
module.website.aws_s3_object.images["telstra.png"]: Refreshing state... [id=images/telstra.png]
module.website.aws_s3_object.images["banner.png"]: Refreshing state... [id=images/banner.png]
module.website.aws_s3_object.static_files["static/js/main.8f7fa289.js.map"]: Refreshing state... [id=website/static/js/main.8f7fa289.js.map]
module.website.aws_s3_object.static_files["static/css/main.ee269497.css"]: Refreshing state... [id=website/static/css/main.ee269497.css]
module.website.aws_s3_object.static_files["static/css/main.ee269497.css.map"]: Refreshing state... [id=website/static/css/main.ee269497.css.map]
module.website.aws_s3_object.static_files["index.html"]: Refreshing state... [id=website/index.html]
module.website.aws_s3_object.static_files["manifest.json"]: Refreshing state... [id=website/manifest.json]
module.website.aws_s3_object.static_files["static/js/496.ba3eafbe.chunk.js.map"]: Refreshing state... [id=website/static/js/496.ba3eafbe.chunk.js.map]
module.website.aws_s3_object.static_files["asset-manifest.json"]: Refreshing state... [id=website/asset-manifest.json]
module.website.aws_s3_object.static_files["static/js/main.8f7fa289.js"]: Refreshing state... [id=website/static/js/main.8f7fa289.js]
module.website.aws_s3_object.static_files["robots.txt"]: Refreshing state... [id=website/robots.txt]
module.website.aws_s3_object.static_files["favicon.ico"]: Refreshing state... [id=website/favicon.ico]
module.website.aws_s3_object.static_files["static/js/main.8f7fa289.js.LICENSE.txt"]: Refreshing state... [id=website/static/js/main.8f7fa289.js.LICENSE.txt]
module.website.aws_s3_object.static_files["static/js/496.ba3eafbe.chunk.js"]: Refreshing state... [id=website/static/js/496.ba3eafbe.chunk.js]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.website.aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                     = "website/asset-manifest.json"
      ~ source_hash            = "702e7c601c48be6606604c55f24266f2" -> "adc511d2f7b3f7a526339c6dcdc0da38"
        tags                   = {}
      ~ version_id             = "p9LF5TD1FJ6cq4TeClJ.wZgEbo8XXr_U" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                     = "website/index.html"
      ~ source_hash            = "ede618094c731139887ae71ed9aa4b86" -> "df9a2fb72651e2469c5c79cee4ff0244"
        tags                   = {}
      ~ version_id             = "iSIHHAtfueTAaYQDApq8fxwKEBQcbu5g" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/496.ae11a27b.chunk.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/496.ae11a27b.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/496.ae11a27b.chunk.js"
      + source_hash            = "62cc911b1515f5c2bb6822fcd45ca997"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/496.ae11a27b.chunk.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/496.ae11a27b.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/496.ae11a27b.chunk.js.map"
      + source_hash            = "43fffdf68875b8df6d71d769c757cc12"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/496.ba3eafbe.chunk.js"] will be destroyed
  # (because key ["static/js/496.ba3eafbe.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b555017a327b17a1aa196d7eb3c2aad6" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/496.ba3eafbe.chunk.js" -> null
      - key                    = "website/static/js/496.ba3eafbe.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/496.ba3eafbe.chunk.js" -> null
      - source_hash            = "b555017a327b17a1aa196d7eb3c2aad6" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "JZtejDp6YG7bzg_k9wlRcZTq_6cZmQSa" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/496.ba3eafbe.chunk.js.map"] will be destroyed
  # (because key ["static/js/496.ba3eafbe.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "d1a26af4951bc68856ebcc37fecd7059" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/496.ba3eafbe.chunk.js.map" -> null
      - key                    = "website/static/js/496.ba3eafbe.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/496.ba3eafbe.chunk.js.map" -> null
      - source_hash            = "d1a26af4951bc68856ebcc37fecd7059" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "KVs16eLp9gQvr3JdN86oFwbgDYj2_SQs" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.5a9e0468.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.5a9e0468.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.5a9e0468.js"
      + source_hash            = "966f87341b7eb97a2283b2a42e0afdc9"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.5a9e0468.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.5a9e0468.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.5a9e0468.js.LICENSE.txt"
      + source_hash            = "d82f02efc3c438bb23780f8a2d4af104"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.5a9e0468.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "mulla-website"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.5a9e0468.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.5a9e0468.js.map"
      + source_hash            = "11fabe670f42edd45d41074252ae78ee"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.8f7fa289.js"] will be destroyed
  # (because key ["static/js/main.8f7fa289.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "cfde2e2db02df619a595f0a369cfb4f9" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.8f7fa289.js" -> null
      - key                    = "website/static/js/main.8f7fa289.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.8f7fa289.js" -> null
      - source_hash            = "cfde2e2db02df619a595f0a369cfb4f9" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "RAOeKz8EQsG0sbIwGQxwwwlotdLW2Ye1" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.8f7fa289.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.8f7fa289.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "d82f02efc3c438bb23780f8a2d4af104" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.8f7fa289.js.LICENSE.txt" -> null
      - key                    = "website/static/js/main.8f7fa289.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.8f7fa289.js.LICENSE.txt" -> null
      - source_hash            = "d82f02efc3c438bb23780f8a2d4af104" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "ND.nRopuXrbYlEj7zdivTl1h5J0__EVk" -> null
    }

  # module.website.aws_s3_object.static_files["static/js/main.8f7fa289.js.map"] will be destroyed
  # (because key ["static/js/main.8f7fa289.js.map"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "mulla-website" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "1f5fb337a941737e24bd104774e13355-2" -> null
      - force_destroy          = false -> null
      - id                     = "website/static/js/main.8f7fa289.js.map" -> null
      - key                    = "website/static/js/main.8f7fa289.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "../webapp/build/static/js/main.8f7fa289.js.map" -> null
      - source_hash            = "a00f8ac80724f0a14881cba312af1761" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "82Szt8RJYzhaXk3VoC_6xbcXjh6l2jyk" -> null
    }

Plan: 5 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*